app/controllers/api/users_controller.rb

  def show
    @user = User.where(id: params[:id]).includes({friends: [:friend_ids, {profile_picture_attachment: :blob}]}).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]

  def find_users
    @users = User.where(id: params[:userIds]).includes(:friend_ids)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "birth_date", "gender", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @user = User.find_by(id: params[:id])
    if @user.id == current_user.id
      @user.attributes.each do |k, v|
        if user_params.include?(k)
          @user[k] = user_params[k]
        end
      end
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
UPDATE "users" SET "biography" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["biography", "this is bio"], ["updated_at", "2021-06-07 02:47:15.864140"], ["id", 62]]